void main() {
  final age = 18;
  // print('-----------------------------------');
  // if (age >= 18) {
  //   print('Повнолітній');
  // } else {
  //   print('Неповнолітній');
  // }
  // print('-----------------------------------');

  //print('-----------------------------------');
  // АБо можна використовувати Тернарний оператор
  //age >= 18 ? print('Повнолітній') : print('Неповнолітній');

  //print(age >= 18 ? 'Повнолітній' : 'Неповнолітній');
  //print('-----------------------------------');

  final temperature = 25;

  // print('-----------------------------------');
  // if (temperature > 30) {
  //   print('Дуже спекотно');
  // } else if (temperature > 20) {
  //   print('Тепло');
  // } else if (temperature > 10) {
  //   print('Прохолодно');
  // } else {
  //   print('Холодно');
  // }
  // print('-----------------------------------');

  // print('-----------------------------------');
  // if (temperature > 30) {
  //   print('Дуже спекотно');
  // } else {
  //   if (temperature > 20) {
  //     print('Тепло');
  //   } else {
  //     if (temperature > 10) {
  //       print('Прохолодно');
  //     } else {
  //       print('Холодно');
  //     }
  //   }
  // }
  // print('-----------------------------------');
}
