void main() async {
  for (var i = 0; i <= 20; i++) {
    await Future<void>.delayed(const Duration(milliseconds: 200));

    print('from loop: $i');
  }
}

/// 1. Простий синхронний цикл
/// 2. В циклі додаємо перевірку на число 10 і в ньому робимо вкладений цикл
/// на 1000 ітерацій в якому додаємо вивід рандомного числа коли доходимо
/// до кінця циклу
/// 3. Поступово збільшуємо кількість цих ітерацій до моменту поки не почне
/// зависати основний цикл.
/// 4. Як це можна вирішити за допомогою ізолятів.
/// 5. Показати приклад на флаттері з отриманням даних з серверу
